In [1]:
import pandas as pd

__Read File__

In [2]:
file1 = open('btc-market-price.csv', mode='r')
file1.read()

'2/4/17 0:00,1099.169125\n3/4/17 0:00,1141.813\n4/4/17 0:00,?\n5/4/17 0:00,1133.079314\n6/4/17 0:00,-\n7/4/17 0:00,-\n8/4/17 0:00,1181.149838\n9/4/17 0:00,1208.8005\n10/4/17 0:00,1207.744875\n11/4/17 0:00,1226.617038\n12/4/17 0:00,1218.92205'

In [3]:
with open('btc-market-price.csv', 'r') as reader:
    for index, line in enumerate(reader.readlines()):
        if (index < 5):        #read just first 5 lines
            print(index, line)

0 2/4/17 0:00,1099.169125

1 3/4/17 0:00,1141.813

2 4/4/17 0:00,?

3 5/4/17 0:00,1133.079314

4 6/4/17 0:00,-

In [4]:
with open('btc-market-price.csv', 'r') as reader:
    for index, line in enumerate(reader.readlines()):
        if (index < 5):        
            timestamp, price = line.split(',')
            print(timestamp, price)

2/4/17 0:00 1099.169125

3/4/17 0:00 1141.813

4/4/17 0:00 ?

5/4/17 0:00 1133.079314

6/4/17 0:00 -

__Read csv__

In [5]:
csv_url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/healthexp.csv"
pd.read_csv(csv_url).head()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [6]:
pd.read_csv('btc-market-price.csv',
            header=None,
            na_values=['', '?', '-'],
            names=['Timestamp', 'Price'],
            dtype={'Price': 'float'},
            parse_dates=[0]).head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN
3 2017-05-04  1133.079314
4 2017-06-04          NaN

In [7]:
pd.read_csv('btc-market-price.csv',
            header=None,
            na_values=['', '?', '-'],
            names=['Timestamp', 'Price'],
            dtype={'Price': 'float'},
            parse_dates=[0],
            index_col=[0]).head()

                  Price
Timestamp
2017-02-04  1099.169125
2017-03-04  1141.813000
2017-04-04          NaN
2017-05-04  1133.079314
2017-06-04          NaN

In [8]:
#Custom numeric decimal and thousands character
pd.read_csv('exam_review.csv', sep='>', decimal=',')

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [9]:
pd.read_csv('exam_review.csv', sep='>', thousands=',')

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

In [10]:
#Loading specific columns
pd.read_csv('exam_review.csv',
            usecols=['first_name', 'last_name', 'age'],
            sep='>')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [11]:
#Using a Series instead of DataFrame
exam_test = pd.read_csv('exam_review.csv', sep='>', usecols=['first_name']).squeeze('columns')
type(exam_test)

pandas.core.series.Series

__Save df to CSV file__

In [12]:
pd.read_csv('exam_review.csv', sep='>', decimal=',').to_csv('exam_out.csv')

__Read data from databases__

In [13]:
from sqlalchemy import create_engine
engine = create_engine('mysql+pymysql://root:@localhost:3306/emp_db')

In [15]:
pd.read_sql_table('departments',engine)

   department_id department_name  location
0             10      ACCOUNTING  NEW YORK
1             20        RESEARCH    DALLAS
2             30           SALES   CHICAGO
3             40      OPERATIONS    BOSTON

In [16]:
pd.read_sql_query("Select * from employees", engine)

,employee_id,employee_name,job,manager_id,hiredate,salary,commission,department_id
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,NaN,20
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,NaN,20
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,NaN,30
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,NaN,10
7,7788,SCOTT,ANALYST,7566.0,1987-06-13,3000.0,NaN,20
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,NaN,10

__Write data to databases__

In [17]:
engine2 = create_engine('mysql+pymysql://root:@localhost:3306/exam_db')

exam_df = pd.read_csv('exam_review.csv', sep='>', decimal=',')
exam_df.to_sql(
    name='exam_out',
    con=engine2,
    if_exists='replace',
    index=False
)

5

__Read HTML Table__

In [18]:
import lxml

In [19]:
df = pd.read_html('https://en.wikipedia.org/wiki/Dhaka_District')
len(df)

6

In [20]:
df[3]

,Religion,Population (1941)[15]: 94–95,Percentage (1941),Population (2011)[14],Percentage (2011)
0,Islam,565552,56.67%,11400096,94.65%
1,Hinduism,422284,42.32%,566368,4.70%
2,Christianity,7073,0.71%,62064,0.52%
3,Others [b],2997,0.30%,15449,0.13%
4,Total Population,997906,100%,12043977,100%

In [21]:
df2 = pd.read_html('https://en.wikipedia.org/wiki/Dhaka_District', match='Historical population')
df2[0]

           Year          Pop.       ±% p.a.
0          1981       4023838             —
1          1991       5839642        +3.79%
2          2001       8511228        +3.84%
3          2011      12043977        +3.53%
4  Sources:[14]  Sources:[14]  Sources:[14]

__Read JSON__

In [3]:
pd.read_json('https://api.sampleapis.com/coffee/hot').head()

,title,description,ingredients,image,id
0,Black,Black coffee is as simple as it gets with grou...,[Coffee],https://upload.wikimedia.org/wikipedia/commons...,1
1,Latte,"As the most popular coffee drink out there, th...","[Espresso, Steamed Milk]",https://upload.wikimedia.org/wikipedia/commons...,2
2,Cappuccino,Cappuccino is a latte made with more foam than...,"[Espresso, Steamed Milk, Foam]",https://upload.wikimedia.org/wikipedia/commons...,3
3,Americano,"With a similar flavor to black coffee, the ame...","[Espresso, Hot Water]",https://upload.wikimedia.org/wikipedia/commons...,4
4,Espresso,An espresso shot can be served solo or used as...,[1oz Espresso],https://upload.wikimedia.org/wikipedia/commons...,5